import { Truck, HeartHandshake, KeyRound, Fingerprint, Key } from "lucide-react";

const icons = [
  { icon: KeyRound, title: "منتجات مكفولة", color: '#251DEE' },
  { icon: HeartHandshake, title: "خدمة ما بعد البيع", color: '#4B12EE' },
  { icon: Truck, title: "توصيل لباب البيت لعدة المحافظات", color: '#6D0EEE' },
  { icon: Key, title: "طرق دفع متعددة", color: '#9E08ED' },
  { icon: Fingerprint, title: "خدمة زبائن أونلاين 24/7", color: '#BB05ED' },
];

const PreFooter = () => {
  return (
    <>
      <div className="lg:flex hidden justify-end relative">
        <span className="absolute top-0 inset-x-0 h-5 bg-gray-400 mx-20"></span>
        <p className="mt-10 px-28 text-right text-xs"> 
          نحن &quot;ديجي شي&quot; شركة تجارة إلكترونيّة مرخّصة، نقدم خدمة التسوّق الالكتروني لكل محبّي التسوّق 
          عبر الإنترنت، بدأنا رحلتنا عام 2019، من قِبل فريق شغوف بالرّيادة والمستقبل، ومختصّ في مجال
          الخدمات الإلكترونية وإدارة الأعمال. نكرّس جميع إمكانياتنا وطاقاتنا لتقديم تجربة تسوّق الكترونية
          سلسة وسهلة وممتعة، من خلال تأمين المنتجات عالية الجودة من أفضل المورّدين وبأسعار منافسة. بالإضافة 
          إلى توفيرنا خدمة التوصيل المجاني إلى عدد من المحافظات السورية، وذلك بهدف ضمان راحة عملائنا وتسهيل عملية
          التسوّق عبر الإنترنت عليهم، دون الحاجة لتحمّل تكاليف التوصيل الإضافية، كما نقدّم أيضاً خدمة الشحن 
          لباقي المحافظات السورية. يتضمن متجرنا مجموعة واسعة من المنتجات المتنوعة، التي يمكن للعملاء 
          اختيار ما يناسبهم منها، وذلك بفضل توفير الصور الواضحة والوصف التفصيلي بالمعلومات 
          الكافية لكل منتج. سواء كنت تبحث عن سلع منزلية، إلكترونيات، إكسسوارات أو ملابس 
          أو غير ذلك، فإن متجرنا يوفّر أكثر من 30 فئة رئيسية مختلفة للاختيار من بينها.
          بالإضافة إلى ذلك، نقدّم باستمرار المنتجات الجديدة المحبوبة والرائجة، مما يضمن أن هناك دائماً شيء جديد ومثير للاكتشاف معنا
          . نذهب في &quot;ديجي شي&quot; إلى أبعد الحدود للتأكد من أن كل عميل لدينا راضٍ كلياً عن عملية الشراء التي قام بها، من خلال ضماننا 
          لإمكانية الإرجاع والاستبدال عند الحاجة، كما أن فريقنا المختص بخدمة العملاء، متاح ومستعد على مدار الساعة للإجابة على 
          أي أسئلة أواستفسارات. خيارات الدفع في &quot;ديجي شي&quot; متنوعة وفعالة، ويمكن للعملاء اختيار الطريقة التي تناسبهم 
          وتسهّل عملية الشراء عليهم، حيث يمكنهم القيام بالدفع مباشرةً عند الاستلام أو الاستفادة من خدمة 
          الدفع الالكتروني. لأننا نهتم بتحقيق رضا العملاء وتقديم تجربة تسوق مميزة لهم، نقوم في
          &quot;ديجي شي&quot; بتقديم مجموعة متنوعة ومستمرة من العروض والخصومات والتخفيضات الموسمية
          على مدار العام، فهناك دائماً فرص للحصول على صفقات رائعة مع &quot;ديجي شي&quot;.
        </p>
      </div>
      <div className="hidden md:grid grid-cols-5 w-full mt-15">
        {icons.map((item, index) => {
          const Icon = item.icon;
          return (
            <div
              key={index}
              className="flex flex-col items-center justify-center p-5 even:bg-gray-200 odd:bg-white/20"
            >
              <Icon className={`size-16 mb-3 text-gray-700 font-extrabold`} color={item.color} />
              <p className="text-gray-700 text-sm text-center font-medium">{item.title}</p>
            </div>
          );
        })}
      </div>
    </>
  );
};

export default PreFooter;
